# from django.test import TestCase
#
# sr ="""1. چه ویژگی‌ای از حسگرهای کوچک موجب پیدایش شبکه حسگر بی‌سیم (WSN) شده است؟
#
# A) هزینه بالا
#
# B) اندازه بزرگ
#
# C) توان مصرفی پایین
#
# D) عدم قابلیت همکاری
#
# 2. گره‌های حسگر در شبکه حسگر بی‌سیم به چه منظور در محیط پخش شده‌اند؟
#
# A) برای ارسال اطلاعات به صورت مستقیم
#
# B) برای جمع‌آوری اطلاعات از محیط
#
# C) برای کاهش هزینه‌ها
#
# D) برای ایجاد یک شبکه محلی """
#
# lst = []
# for s in sr.strip().split('\n'):
#     if s.strip():
#         lst.append(s.strip())
# for i in range(6):
#     q = {
#         "question" : lst[i+1],
#         "A": lst[i+2],
#         "B":lst[i+3],
#         "C":lst[i+4],
#         "D":lst[i+5]
#
#     }
#     print(q)
